cf/DataProcessors/MonthEnd.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>MonthEnd</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Period</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

cf/Documents/FixedAssetsDepreciation.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>FixedAssetsDepreciation</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Managerial</xr:Item>
				<xr:Item>AccumulationRegister.Inventory</xr:Item>
				<xr:Item>AccumulationRegister.IncomeAndExpenses</xr:Item>
				<xr:Item>InformationRegister.MonthEndErrors</xr:Item>
				<xr:Item>AccumulationRegister.FixedAssets</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Author</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/Documents/MonthEnd.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>MonthEnd</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ReportOnCurrencyRatesDifference</xr:Item>
				<xr:Item>AccumulationRegister.CashInCashRegisters</xr:Item>
				<xr:Item>AccumulationRegister.Sales</xr:Item>
				<xr:Item>AccumulationRegister.RetailAmountAccounting</xr:Item>
				<xr:Item>AccumulationRegister.FinancialResult</xr:Item>
				<xr:Item>AccumulationRegister.AdvanceHolderPayments</xr:Item>
				<xr:Item>InformationRegister.WriteOffCostsCorrectionNodes</xr:Item>
				<xr:Item>AccountingRegister.Managerial</xr:Item>
				<xr:Item>AccumulationRegister.AccountsReceivable</xr:Item>
				<xr:Item>AccumulationRegister.Inventory</xr:Item>
				<xr:Item>AccumulationRegister.PayrollPayments</xr:Item>
				<xr:Item>AccumulationRegister.CashAssets</xr:Item>
				<xr:Item>AccumulationRegister.IncomeAndExpenses</xr:Item>
				<xr:Item>AccumulationRegister.AccountsPayable</xr:Item>
				<xr:Item>InformationRegister.MonthEndErrors</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DirectCostCalculation</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CostAllocation</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ActualCostCalculation</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FinancialResultCalculation</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExchangeDifferencesCalculation</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RetailCostCalculationAccrualAccounting</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Author</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/DataProcessors/MonthEnd/Ext/ManagerModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region ProgramInterface

Procedure ExecuteMonthEnd(ParametersStructure, BackgroundJobStorageAddress = "") Export
	
	CurMonth = ParametersStructure.CurMonth;
	CurYear = ParametersStructure.CurYear;
	Company = ParametersStructure.Company;
	OperationArray = ParametersStructure.OperationArray;
	
	StructureOfCurrentDocuments = CancelMonthEnd(ParametersStructure);
	
	If ParametersStructure.ExecuteCalculationOfDepreciation Then
		
		If ValueIsFilled(StructureOfCurrentDocuments.DocumentFixedAssetsDepreciation) Then
			
			DocObject = StructureOfCurrentDocuments.DocumentFixedAssetsDepreciation.GetObject();
			If DocObject.DeletionMark Then
				DocObject.SetDeletionMark(False);
			EndIf;
			
		Else
			
			DocObject = Documents.FixedAssetsDepreciation.CreateDocument();
			DocObject.Company = Company;
			DocObject.Date = EndOfMonth(Date(CurYear, CurMonth, 1));
			DocObject.Comment = NStr("en='#Created automatically using month-end closing wizard.';ru='#Создан автоматически, помощником закрытия месяца.'");
			
		EndIf;
		
		DocObject.Write(DocumentWriteMode.Posting);
		
	EndIf;
	
	DocumentArrayMC = StructureOfCurrentDocuments.DocumentMonthEnd;
	ArraySizeDocumentsZM = DocumentArrayMC.Count() - 1;
	OperationArraySize = OperationArray.Count() - 1;
	
	For Iterator = 0 To OperationArraySize Do
		
		Operation = OperationArray[Iterator];
		DocumentClosingMonth = ?(Iterator <= ArraySizeDocumentsZM, DocumentArrayMC[Iterator], Undefined);
		RunOperationClosingMonth(ParametersStructure, Operation, DocumentClosingMonth);
		
	EndDo;
	
EndProcedure

Function CancelMonthEnd(ParametersStructure) Export
	
	CurMonth = ParametersStructure.CurMonth;
	CurYear = ParametersStructure.CurYear;
	Company = ParametersStructure.Company;
	
	ReturnStructure = New Structure("DocumentMonthEnd, DocumentFixedAssetsDepreciation");
	
	Query = New Query;
	
	Query.Text =
	"SELECT
	|	MonthEnd.Date AS Date,
	|	MonthEnd.Ref AS Ref
	|FROM
	|	Document.MonthEnd AS MonthEnd
	|WHERE
	|	YEAR(MonthEnd.Date) = &Year
	|	AND MONTH(MonthEnd.Date) = &Month
	|	AND MonthEnd.Company = &Company
	|
	|ORDER BY
	|	Date,
	|	Ref
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	FixedAssetsDepreciation.Date AS Date,
	|	FixedAssetsDepreciation.Ref AS Ref
	|FROM
	|	Document.FixedAssetsDepreciation AS FixedAssetsDepreciation
	|WHERE
	|	YEAR(FixedAssetsDepreciation.Date) = &Year
	|	AND MONTH(FixedAssetsDepreciation.Date) = &Month
	|	AND FixedAssetsDepreciation.Company = &Company
	|
	|ORDER BY
	|	Date,
	|	Ref";
	
	Query.SetParameter("Year", CurYear);
	Query.SetParameter("Month", CurMonth);
	Query.SetParameter("Company", Company);
	
	QueryResult = Query.ExecuteBatch();
	
	DocSelection = QueryResult[1].Select();
	While DocSelection.Next() Do
		
		DocObject = DocSelection.Ref.GetObject();
		If DocObject.DeletionMark Then
			DocObject.SetDeletionMark(False);
		EndIf;
		
		DocObject.Write(DocumentWriteMode.UndoPosting);
		ReturnStructure.DocumentFixedAssetsDepreciation = DocSelection.Ref;
		
	EndDo;
	
	ReturnStructure.DocumentMonthEnd = New Array;
	
	DocSelection = QueryResult[0].Select();
	While DocSelection.Next() Do
		
		DocObject = DocSelection.Ref.GetObject();
		If DocObject.DeletionMark Then
			DocObject.SetDeletionMark(False);
		EndIf;
		
		DocObject.Write(DocumentWriteMode.UndoPosting);
		ReturnStructure.DocumentMonthEnd.Add(DocSelection.Ref);
		
	EndDo;
	
	Return ReturnStructure;
	
EndFunction

#EndRegion

#Region ServiceProceduresAndFunctions

Procedure RunOperationClosingMonth(ParametersStructure, Operation, DocumentClosingMonth)
	
	CurMonth = ParametersStructure.CurMonth;
	CurYear = ParametersStructure.CurYear;
	Company = ParametersStructure.Company;
	
	If DocumentClosingMonth = Undefined Then
		
		DocObject = Documents.MonthEnd.CreateDocument();
		DocObject.Company = Company;
		DocObject.Date = EndOfMonth(Date(CurYear, CurMonth, 1));
		DocObject.Comment = NStr("en='#Created automatically using month-end closing wizard.';ru='#Создан автоматически, помощником закрытия месяца.'");
		
	Else
		
		DocObject = DocumentClosingMonth.GetObject();
		
		If DocObject.DeletionMark Then
			DocObject.SetDeletionMark(False);
		EndIf;
		
		DocObject.DirectCostCalculation = False;
		DocObject.CostAllocation = False;
		DocObject.ActualCostCalculation = False;
		DocObject.FinancialResultCalculation = False;
		DocObject.ExchangeDifferencesCalculation = False;
		DocObject.RetailCostCalculationAccrualAccounting = False;
		
	EndIf;
	
	DocObject[Operation] = True;
	DocObject.Write(DocumentWriteMode.Posting);
	
EndProcedure

#EndRegion

#EndIf
